app/Controllers/ProjectController.php

SELECT *
FROM `tbl_files`
WHERE `file_status_flag` = 1
SELECT *
FROM `tbl_project`
WHERE `project_status_flag` = 0
AND `clientid` = '3'
SELECT *
FROM `tbl_project`
WHERE `clientid` = '3'
AND `project_status_flag` = 1
SELECT COUNT(*) AS `numrows`
FROM `tbl_project`
WHERE `clientid` = '3'
AND `project_status_flag` = 1
---
    public function index() {
        $session = session();
        $it = $this->itModel->where('userId', $session->get('id'))->first();
        $all_document = $this->filesModel->where('file_status_flag', 1)->findAll();
        $client = $this->clientModel->where('userId', $session->get('id'))->first();
        $site = $client['company'].'’ '.'Project Lists';
        $all_client = $this->clientModel->findAll();
        $all = $this->projectModel->where('clientid', $client['id'])->where('project_status_flag', 0)->findAll();
        $project = $this->projectModel
            ->where([
                'project_status_flag' => 0,
                'clientid' => $client['id']])
            ->findAll();

        $notstarted = $this->projectModel
            ->where([
                'project_label' => 'Not Started',
                'project_status_flag' => 0,
                'clientid' => $client['id']])
            ->countAllResults();

SELECT `itprofile`.*, `tbl_project`.*
FROM `tbl_project`
JOIN `itprofile` ON `tbl_project`.`pmid` = `itprofile`.`id`
WHERE `tbl_project`.`projectid` = '15'
SELECT `tbl_project`.*, `clientprofile`.*
FROM `tbl_project`
JOIN `clientprofile` ON `tbl_project`.`clientid` = `clientprofile`.`id`
WHERE `tbl_project`.`projectid` = '15'
 LIMIT 1
---
                'project_status_flag' => 1])
            ->countAllResults();

        $p_notstarted = $this->projectModel
            ->where([
                'project_label' => 'Not Started',
                'project_status_flag' => 0,
                'clientid' => $client['id']])
            ->findAll();

        $p_progress = $this->projectModel
            ->where([
                'project_label' => 'In Progress',
                'project_status_flag' => 0,
                'clientid' => $client['id']])
            ->findAll();

SELECT `tbl_logs`.*, `tbl_project`.`projectid`, `user`.`id`, `user`.`name`
FROM `tbl_project`
JOIN `tbl_logs` ON `tbl_project`.`projectid` = `tbl_logs`.`projectid`
JOIN `user` ON `tbl_logs`.`userid` = `user`.`id`
WHERE `tbl_logs`.`projectid` = '15'
AND `tbl_project`.`project_status_flag` = 0
ORDER BY `tbl_logs`.`created_at` DESC
---
                'clientid' => $client['id']])
            ->findAll();

        $p_completed = $this->projectModel
            ->where([
                'project_label' => 'Completed',
                'project_status_flag' => 0,
                'clientid' => $client['id']])
            ->findAll();

UPDATE `tbl_project` SET `pmid` = NULL
WHERE `tbl_project`.`projectid` IN ('15')
---
    public function createProject() {
        try {
            $projectCode = bin2hex(random_bytes(5)); // Generate a random hexadecimal string of 10 characters

            $data = [
                'project_name' => $this->request->getVar('project_title'),
                'project_alias_name' => $this->request->getVar('project_alias'),
                'clientid' => $this->request->getVar('clientid'),
                'allot_skills' => $this->request->getVar('skills'),
                'specialist_tag' => $this->request->getVar('specialist'),
                'project_budget' => $this->request->getVar('offered_rate'),
                'start_date' => $this->request->getVar('start_date'),
                'due_date' => $this->request->getVar('due_date'),
                'project_allot_time' => $this->request->getVar('allot_time'),
                'description' => $this->request->getVar('project_description'),
                'project_code' => $projectCode,
                'project_label' => 'Not Started'
            ];

            if ($this->projectModel->save($data)) {